const Map<String, String> provincesDataGd = {
  "440000": "广东省",
};

const Map<String, dynamic> citiesDataGd = {
  "440000": {
    "440100": {"name": "广州市", "alpha": "g"},
    "440800": {"name": "湛江市", "alpha": "z"},
    "440900": {"name": "茂名市", "alpha": "m"},
  },
  "440100": {
    "440103": {"name": "荔湾区", "alpha": "l"},
    "440104": {"name": "越秀区", "alpha": "y"},
    "440105": {"name": "海珠区", "alpha": "h"},
    "440106": {"name": "天河区", "alpha": "t"},
    "440111": {"name": "白云区", "alpha": "b"},
    "440112": {"name": "黄埔区", "alpha": "h"},
    "440113": {"name": "番禺区", "alpha": "f"},
    "440114": {"name": "花都区", "alpha": "h"},
    "440115": {"name": "南沙区", "alpha": "n"},
    "440117": {"name": "从化区", "alpha": "c"},
    "440118": {"name": "增城区", "alpha": "z"}
  },
  "440800": {
    "440802": {"name": "赤坎区", "alpha": "c"},
    "440803": {"name": "霞山区", "alpha": "x"},
    "440804": {"name": "坡头区", "alpha": "p"},
    "440811": {"name": "麻章区", "alpha": "m"},
    "440823": {"name": "遂溪县", "alpha": "s"},
    "440825": {"name": "徐闻县", "alpha": "x"},
    "440881": {"name": "廉江市", "alpha": "l"},
    "440882": {"name": "雷州市", "alpha": "l"},
    "440883": {"name": "吴川市", "alpha": "w"}
  },

  "440883": {
    "440883001": {"name": "梅录街道", "alpha": "m"},
    "440883002": {"name": "塘尾街道", "alpha": "t"},
    "440883003": {"name": "大山江街道", "alpha": "d"},
    "440883004": {"name": "博铺街道", "alpha": "b"},
    "440883005": {"name": "海滨街道", "alpha": "h"},
    "440883100": {"name": "浅水镇", "alpha": "q"},
    "440883101": {"name": "长岐镇", "alpha": "c"},
    "440883102": {"name": "覃巴镇", "alpha": "q"},
    "440883103": {"name": "王村港镇", "alpha": "w"},
    "440883104": {"name": "振文镇", "alpha": "z"},
    "440883105": {"name": "樟铺镇", "alpha": "z"},
    "440883106": {"name": "吴阳镇", "alpha": "w"},
    "440883107": {"name": "塘缀镇", "alpha": "t"},
    "440883109": {"name": "黄坡镇", "alpha": "h"},
    "440883111": {"name": "兰石镇", "alpha": "l"}
  },

  "440900": {
    "440902": {"name": "茂南区", "alpha": "m"},
    "440904": {"name": "电白区", "alpha": "d"},
    "440981": {"name": "高州市", "alpha": "g"},
    "440982": {"name": "化州市", "alpha": "h"},
    "440983": {"name": "信宜市", "alpha": "x"}
  },
};
